api/modules/v1/models/VacancyQuery.php

SELECT * FROM `vacancy`
---
    public function all($db = null)
    {
        return parent::all($db);