api/modules/v1/models/VacancyViews.php

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=3)
SELECT EXISTS(SELECT * FROM `vacancy_views` WHERE (`user_id`=3) AND (`vacancy_id`=1))
SELECT * FROM `vacancy_views` WHERE (`user_id`=3) AND (`vacancy_id`=1)
INSERT INTO `vacancy_views` (`vacancy_id`, `user_id`) VALUES (1, 3)
---
    public static function findOrCreate($vacancy_id)
    {
        $view = VacancyViews::find()->where(
            [
                'user_id' => Yii::$app->user->id,
                'vacancy_id' => $vacancy_id
            ]
        )->one();

        if($view === null){
            $view = new VacancyViews();
            $view->vacancy_id = $vacancy_id;
            $view->user_id = Yii::$app->user->id;
            $view->save();