api/modules/v1/models/Vacancy.php

SELECT * FROM `user` WHERE `id`=3
SELECT COUNT(*) FROM `vacancy_views` WHERE `vacancy_id`=1
SELECT COUNT(*) FROM `vacancy_clicks` WHERE `vacancy_id`=1
---
    public function afterFind()
    {
        $this->position_id = Positions::findOne($this->position_id)?->title;
        $this->user_id     = User::findOne($this->user_id)?->username;
        $this->views       = VacancyViews::find()->where(['vacancy_id' => $this->id])?->count();
        $this->clicks      = VacancyClicks::find()->where(['vacancy_id' => $this->id])?->count();