common/models/User.php

SELECT * FROM `user` WHERE `auth_key`='Ip1oJMsNgGPRwU8x3I4azWsrrOmysZd9'
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token]);